app/controllers/alarms_controller.rb

SELECT "alarms".* FROM "alarms"
---
  def index
    @alarms = Alarm.all

INSERT INTO "alarms" ("name", "user", "time", "repeats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "School Day"], ["user", "emmy1345@hotmail.com"], ["time", 235555555], ["repeats", true], ["created_at", 2016-07-13 20:02:14 UTC], ["updated_at", 2016-07-13 20:02:14 UTC]]
---
  def create
    @alarm = Alarm.new(alarm_params)

    respond_to do |format|
      if @alarm.save

DELETE FROM "alarms" WHERE "alarms"."id" = ?  [["id", 980190962]]
---
  def destroy
    @alarm.destroy

SELECT  "alarms".* FROM "alarms" WHERE "alarms"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_alarm
      @alarm = Alarm.find(params[:id])