app/controllers/events_controller.rb

INSERT INTO "events" ("user", "name", "date_and_time", "repeats", "frequency", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save