app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "user", "file", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "MyString"], ["user", "MyString"], ["file", "MyString"], ["created_at", 2016-07-15 21:53:13 UTC], ["updated_at", 2016-07-15 21:53:13 UTC]]
---
  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save